In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\acer\appdata\local\programs\python\python311\lib\site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\acer\appdata\roaming\python\python311\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\acer\appdata\local\programs\python\python311\lib\site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in c:\users\acer\appdata\local\programs\python\python311\lib\site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in c:\users\acer\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip available: 22.3 -> 23.1.2
[notice] To update, run: python.exe -m pip install --upgrade pip

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23,     and 42. Then, print the series.

In [2]:
import pandas as pd

In [3]:
panda_series = 4, 8, 15, 16, 23, 42

In [4]:
new_series = pd.Series(panda_series)

In [5]:
new_series

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply         pandas.Series function on the variable print it.

In [6]:
py_variable = [
    "Amit", "sweta", "shivani", "Ashish", "kajal", 1, 5, 9,
               {"shubham":"kumar"}, {"Amit":"sweta"}
]

In [7]:
py_variable2 = pd.Series(py_variable)

In [8]:
print(py_variable2)

0                    Amit
1                   sweta
2                 shivani
3                  Ashish
4                   kajal
5                       1
6                       5
7                       9
8    {'shubham': 'kumar'}
9       {'Amit': 'sweta'}
dtype: object

Q3. Create a Pandas DataFrame that contains the following data:

In [9]:
df = {
    "Name":["Alice","Bob","claire"], "Age":[25,30,27], "Gender":["Female","Male","Female"]
}

In [10]:
df2 = pd.DataFrame(df)

In [11]:
df2

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series?       Explain with an example.

Ans:In Pandas, a DataFrame is a two-dimensional labeled data structure,             consisting of rows and columns, similar to a spreadsheet or a SQL table. It     is the most commonly used Pandas object and is used to manipulate and           analyze data in Python.

    On the other hand, a Series is a one-dimensional labeled data structure in     Pandas. It can be thought of as a single column of data from a DataFrame.

    is an example to illustrate the difference between a DataFrame and a Series     in Pandas:

    Suppose we have the following data about the population of different           cities:

In [12]:
data = {
    "City":["New York", "Los Angeles", "Chicago", "Houston", "Phoenix"],
    "Population":[8336817,3979576,2693976,2320268,1680992]
}

In [13]:
df = pd.DataFrame(data)

In [14]:
df

          City  Population
0     New York     8336817
1  Los Angeles     3979576
2      Chicago     2693976
3      Houston     2320268
4      Phoenix     1680992

In [15]:
df2 = pd.Series(data)

In [16]:
df2

City          [New York, Los Angeles, Chicago, Houston, Phoe...
Population        [8336817, 3979576, 2693976, 2320268, 1680992]
dtype: object

Q5. What are some common functions you can use to manipulate data in a Pandas       DataFrame? Can you give an example of when you might use one of these           functions?

Ans: Pandas DataFrame provides many functions to manipulate data. Here are some      common functions that are frequently used:
  
head() and tail(): These functions return the first and last n rows of the                        DataFrame, respectively. They are useful to get a quick                        overview of the data.

describe(): This function returns various summary statistics of the numerical               columns in the DataFrame, such as mean, standard deviation,                     minimum, maximum, etc.

info(): This function returns the information about the DataFrame, such as the         number of rows and columns, data types of columns, memory usage, etc.

drop(): This function is used to drop specified labels from rows or columns of         the DataFrame. For example, if we want to drop the "Population" column         from the DataFrame in the previous example, we can use the following           code:

This will drop the population.

In [17]:
data = {
    "City":["New York", "Los Angeles", "Chicago", "Houston", "Phoenix"],
    "Population":[8336817,3979576,2693976,2320268,1680992]
}

In [18]:
df = pd.DataFrame(data)

In [19]:
df

          City  Population
0     New York     8336817
1  Los Angeles     3979576
2      Chicago     2693976
3      Houston     2320268
4      Phoenix     1680992

In [21]:
df.drop('Population', axis=1, inplace=True)

In [22]:
df

          City
0     New York
1  Los Angeles
2      Chicago
3      Houston
4      Phoenix

This will drop the "Population" column from the DataFrame in place.

sort_values(): This function is used to sort the DataFrame by one or more              columns. For example, if we want to sort the DataFrame by the "City" column in ascending order, we can use the following code:

In [27]:
df.sort_values(by='City',inplace=True)

In [28]:
df

          City
2      Chicago
3      Houston
1  Los Angeles
0     New York
4      Phoenix

This will sort the DataFrame by the "City" column in ascending order.

groupby(): This function is used to group the DataFrame by one or more columns and apply a function on each group. For example, if we want to calculate the average population for each state in the DataFrame, we can use the following code:

In [32]:
data = {
    "City":["New York", "Los Angeles", "Chicago", "Houston", "Phoenix"],
    "Population":[8336817,3979576,2693976,2320268,1680992]
}

In [33]:
df = pd.DataFrame(data)

In [34]:
df

          City  Population
0     New York     8336817
1  Los Angeles     3979576
2      Chicago     2693976
3      Houston     2320268
4      Phoenix     1680992

In [37]:
state_pop = df.groupby('City')['Population'].mean()

In [38]:
state_pop

City
Chicago        2693976.0
Houston        2320268.0
Los Angeles    3979576.0
New York       8336817.0
Phoenix        1680992.0
Name: Population, dtype: float64

merge(): This function is used to merge two or more DataFrames based on a common column. For example, if we have two DataFrames - one with population data and another with GDP data - and we want to merge them based on the "City" column.

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans: 
In Pandas, both Series and DataFrame are mutable in nature, whereas Panel is not mutable.

When a Series or DataFrame object is modified, the changes are made in place, and the original object is modified. This means that any changes made to a Series or DataFrame object will be reflected in the original object.

On the other hand, Panel is an immutable data structure in Pandas, which means that any modification to a Panel object will create a new object instead of modifying the original one. As a result, Panels are less commonly used compared to Series and DataFrame in Pandas.

However, it is worth noting that Panel has been deprecated since Pandas version 0.25.0 and has been replaced by the more general MultiIndex objects.

Q7. Create a DataFrame using multiple Series. Explain with an example.

Ans: To create a DataFrame using multiple Series, we can pass a dictionary where the keys are the column names, and the values are the Series objects. Here is an example:

In [1]:
import pandas as pd

Data1 = pd.Series([25, 28, 30])

Data2 = pd.Series([60, 65, 70])

Data3 = pd.Series(["Amit", "Sweta", "Kunal"])

df = {
    'Day1':Data1, 'Day2':Data2, 'Day3':Data3
}

new_df = pd.DataFrame(df)

In [2]:
new_df

   Day1  Day2   Day3
0    25    60   Amit
1    28    65  Sweta
2    30    70  Kunal